package main;

/**
 * Вспомогательный класс с данными, на основе которых нужно производить расчет
 * Данные могут отличаться от реальных (эксраполированы или округлены)
 */
public class Constants {

    public static final double MAX_PERCENT_VALUE = 100.0;
    public static final int LOW_LIMIT_YEAR = 2002;
    public static final int HIGH_LIMIT_YEAR = 2021;

    //Индекс мос биржи с 2002 по 2022 сверху вниз
    public static final double[] MOEX_RATE = {
            417.42, //2002
            673.72, //2003
            722.81, //2004
            1323.32, //2005
            2216.63, //2006
            2472.38,// 2007
            810.922, //2008
            1793.24,//2009
            2209.46,//2010
            1835.14,//2011
            1934.43,//2012
            1967.83,//2013
            1828.06,//2014
            2305.50,//2015
            3042.00,//2016
            3015.71,//2017
            3564.05,//2018
            4887.25,//2019
            5567.28, //2020
            6731.43, //2021
            4170.35  //2022
    };
    //Инфляция с 2002 по 2022 сверху вниз
    public static final double[] INFLATION_RATE = {
            15.06, //2002
            11.99, //2003
            11.74, //2004
            10.91, //2005
            9.00, //2006
            11.87, //2007
            13.28, //2008
            8.80, //2009
            8.78, //2010
            6.10, //2011
            6.58, //2012
            6.45, //2013
            11.36, //2014
            12.91, //2015
            5.38, //2016
            2.52, //2017
            4.27, //2018
            03.05, //2019
            4.91, //2020
            8.39, //2021
            11.92, //2022
    };

}